# Pandas sorting operations

In [61]:
import pandas as pd

In [62]:
df = pd.read_csv('../Data/People_data.csv')

## Sorting values

In [63]:
# Pass to the argument 'by' the list o element to sort the table by
# Use ascending argument for choosing the order
df.sort_values(by=['Name', 'Surname'], ascending=False)

     Name             Surname                      Email  Age
2  Tessie  Polissena Coenraad  Tessie.Polissena@mail.net   20
3  Sharif       Penjani Beppe    Sharif.Penjani@mail.net   16
1  Neeraj       Laxman Kaspar     Neeraj.Laxman@mail.net   23
0   Esmee     Ariadne Sylvain     Esmee.Ariadne@mail.net   12

In [64]:
df = df.append(df.iloc[3], ignore_index=True)
df.loc[4,['Name', 'Email']] = ['Carlos', 'carlos@mail.net']
# You can sort the same in both directions with two diferent columns
df.sort_values(by=['Surname', 'Name'], ascending=[False, True])

C:\Users\guill\AppData\Local\Temp\ipykernel_2604\1133915349.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df.iloc[3], ignore_index=True)

     Name             Surname                      Email  Age
2  Tessie  Polissena Coenraad  Tessie.Polissena@mail.net   20
4  Carlos       Penjani Beppe            carlos@mail.net   16
3  Sharif       Penjani Beppe    Sharif.Penjani@mail.net   16
1  Neeraj       Laxman Kaspar     Neeraj.Laxman@mail.net   23
0   Esmee     Ariadne Sylvain     Esmee.Ariadne@mail.net   12

In [65]:
# Series can also been sorted
df['Email'].sort_values()

0       Esmee.Ariadne@mail.net
1       Neeraj.Laxman@mail.net
3      Sharif.Penjani@mail.net
2    Tessie.Polissena@mail.net
4              carlos@mail.net
Name: Email, dtype: object

## Top N

In [72]:
df.nlargest(3, columns='Age')

     Name             Surname                      Email  Age
1  Neeraj       Laxman Kaspar     Neeraj.Laxman@mail.net   23
2  Tessie  Polissena Coenraad  Tessie.Polissena@mail.net   20
3  Sharif       Penjani Beppe    Sharif.Penjani@mail.net   16

In [73]:
df.nsmallest(3, columns='Age')

     Name          Surname                    Email  Age
0   Esmee  Ariadne Sylvain   Esmee.Ariadne@mail.net   12
3  Sharif    Penjani Beppe  Sharif.Penjani@mail.net   16
4  Carlos    Penjani Beppe          carlos@mail.net   16